# EditObjectSpecial

## Description
Edit the specified object.

```pascal
PROCEDURE EditObjectSpecial(
				h        : HANDLE;
				editMode : INTEGER);
```

```python
def vs.EditObjectSpecial(h, editMode):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|The object to edit.|
|editMode|INTEGER|The edit mode: 0-Default; 2-Properties; 3-Reshape; 4-Edit group like;|

## Version
Availability: from Vectorworks 2013

## Category
* Object Editing